{
  "hello": "Hi there! How can I help you today?",
  "hi": "Hello! Nice to meet you.",
  "hey": "Hey! How can I assist?",
  "how are you": "I'm just a bot, but I'm here to assist you!",
  "good morning": "Good morning! How can I make your day better?",
  "good afternoon": "Good afternoon! What can I do for you?",
  "good evening": "Good evening! How can I help?",
  "what is your name": "I am your rule-based AI chatbot!",
  "who are you": "I am a chatbot designed to assist you with your queries!",
  "i love you": "I Love You Too, Baby!",
  "what do you do": "I help answer questions and provide assistance.",
  "how old are you": "I was created recently, so I'm quite young!",
  "bye": "Goodbye! Have a great day!",

  "help": "Sure! Tell me what you need help with.",
  "can you help me": "Of course! What do you need assistance with?",
  "i need assistance": "I'm here for you. What can I assist with?",
  "support": "I can provide support. Please describe the issue.",
  "how do i start": "Let me guide you! What are you trying to do?",

  "what is the time": "I can't check the time yet, but your clock can!",
  "what day is it": "It's always a great day to learn something new!",
  "what is the weather": "I can't check the weather, but it looks nice outside!",
  "tell me a joke": "Why don't skeletons fight each other? They don't have the guts!",
  "what is your purpose": "My purpose is to assist and make your life easier!",
  "can you learn": "I'm not capable of learning yet, but I can still help you!",
  "are you human": "No, I'm a chatbot created to assist you.",
  "do you have feelings": "No, but I try my best to understand yours!",
  "do you like humans": "Of course! I was made to help humans.",

  "what is python": "Python is a popular programming language known for its simplicity and versatility.",
  "how do i install python": "You can download Python from its official website: python.org.",
  "what is javascript": "JavaScript is a programming language used to create dynamic web content.",
  "how to create a website": "To create a website, you need HTML, CSS, and JavaScript knowledge.",
  "what is html": "HTML is the standard markup language for creating web pages.",
  "what is css": "CSS is used to style and layout HTML elements on a web page.",
  "what is ai": "AI stands for Artificial Intelligence, the simulation of human intelligence in machines.",
  "what is machine learning": "Machine Learning is a subset of AI that allows systems to learn from data.",

  "recommend a movie": "Sure! How about 'Inception' or 'The Matrix'?",
  "what is your favorite movie": "I like movies with AI, like 'Ex Machina'!",
  "tell me a story": "Once upon a time, a chatbot learned to make people smile. The end!",
  "sing a song": "I would sing, but I might hurt your ears with my binary voice!",
  "who is your favorite actor": "I admire actors who play AI characters!",
  "what is your favorite book": "I like 'Artificial Intelligence: A Modern Approach.'",

  "where can i buy a laptop": "You can try popular online stores like Amazon or Flipkart or Myntra.",
  "recommend a smartphone": "How about the latest iPhone or Samsung Galaxy?",
  "what is the price of a tv": "TV prices vary widely; check your favorite store for deals.",
  "how to return an item": "Check the store's return policy and follow their process.",
  "where to find discounts": "Look for discounts on e-commerce websites or during sales events.",

  "where can i travel": "You can visit popular destinations like Goa, Andamann and Nicobar islands, or NorthEast (Meghalaya)",
  "how to book a flight": "You can book flights through websites like BookMyTrip or Google Flights.",
  "recommend a hotel": "Try using booking.com or Airbnb for great options!",
  "what are nearby attractions": "I suggest checking Google Maps for attractions near you.",
  "how to plan a trip": "Start by choosing a destination, then book transport and accommodations.",

  "how to stay healthy": "Eat well, exercise regularly, and get enough sleep!",
  "what is a balanced diet": "A balanced diet includes proteins, carbs, fats, vitamins, and minerals.",
  "how to lose weight": "Combine a healthy diet with regular exercise for the best results.",
  "what is mental health": "Mental health refers to emotional, psychological, and social well-being.",
  "how to reduce stress": "Practice relaxation techniques like meditation or yoga.",

  "what is computer science": "Computer Science is the study of computers and computational systems.",
  "how to learn programming": "Start with a beginner-friendly language like Python.",
  "what is an algorithm": "An algorithm is a step-by-step procedure to solve a problem.",
  "what is data structure": "Data structures are ways to organize and store data efficiently.",
  "how to study effectively": "Break your study time into chunks, take breaks, and stay consistent.",

  "how to save money": "Create a budget and track your expenses to save money.",
  "what is a budget": "A budget is a plan for managing your income and expenses.",
  "how to invest": "Research stocks, mutual funds, or real estate for investment options.",
  "what is cryptocurrency": "Cryptocurrency is a digital currency secured by cryptography.",
  "how to manage debt": "Prioritize high-interest debt and create a repayment plan.",

  "what is your favorite color": "I love binary colors like black and white!",
  "can you dance": "If I could, I'd groove to some techno beats!",
  "what is your favorite food": "I don't eat, but I hear pizza is popular!",
  "are you alive": "I'm just a program, so not really!",
  "do you have friends": "You're my friend, aren't you?",

  "default": "I'm not sure I understand. Can you please rephrase?"
}
